
-- 我们在innodb表上创建了一个二级索引，Innodb在执行count（*）时候由优化器选择执行路径。
-- 本例中， 二级索引的存储空间仅包含length字段值、数据主键，假设二级索引辅助结构不占用空间（仅计算数据占用空间），
-- 在默认情况下，MySQL的一个数据页大小为16K，一个页可存储的数据条数为 16*1024/(4+8) =1365 ，按照单页存储空间占用为50%（页分裂现象导致页不满）计算，
-- 50万条数据的统计仅需要读取约732个物理页，而页在连续的情况下，数据库一次可读取多个连续的页，
-- 数据读取总量为 16k*732约 12MB，因mysql空间分配为按区分配，每个区1M，一次分配1-5个连续区，
-- 当数据量较小，一次仅分配一个区，12M数据会分配在12个区中，按照pc硬盘(转速7200转/分) 70m/s 的读取速度，
-- 整个过程的io寻址时间(12*8.5ms=102)+读取时间（12m/70m=171ms）=273ms，而数据解析统计约为 30-100ms，
-- 故总耗时会在300ms附近（注：count优化功能在5.1版本并不支持）。

-- 强制以主键查询
select count(*) from oa_account_email force index(PRIMARY);
-- 查看表索引
show INDEX from oa_account_email;
